### Total number of babies in specific years

In [1]:
#Using your parse_dataset() function write a program that calculates the total number of babys for the year 2020 and prints the number to the screen. Make sure to select the correct column to sum.
#Do the same for 1950 and compare the results
#What other interesting insights can you find about about a year using some of pandas methods?

In [2]:
import pandas as pd

In [3]:
def parse_dataset(year):
    #opening a text file and returning a dataframe for one year 
    #year = input(f'Please input year')
    df = pd.read_csv(f'../data/data/names/yob{year}.txt', names = ["name", "gender", "frequency"])
    return df

year = 1950

parse_dataset(1950)

           name gender  frequency
0         Linda      F      80431
1          Mary      F      65481
2      Patricia      F      47944
3       Barbara      F      41554
4         Susan      F      38016
...         ...    ...        ...
10300   Zachery      M          5
10301   Zackary      M          5
10302    Zannie      M          5
10303      Zeke      M          5
10304   Zygmunt      M          5

[10305 rows x 3 columns]

In [4]:
df_1950 = parse_dataset(1950)

In [5]:
total_babies_1950 = df_1950["frequency"].sum()
total_babies_1950

3503404

In [6]:
df_2020 = parse_dataset(2020)

In [7]:
total_babies_2020 = df_2020['frequency'].sum()
total_babies_2020

3333981

In [8]:
parse_dataset(2020)

            name gender  frequency
0         Olivia      F      17664
1           Emma      F      15680
2            Ava      F      13179
3      Charlotte      F      13083
4         Sophia      F      13070
...          ...    ...        ...
31512     Zykier      M          5
31513      Zylus      M          5
31514     Zymari      M          5
31515        Zyn      M          5
31516      Zyran      M          5

[31517 rows x 3 columns]

In [9]:
df_1950['frequency'].sort_values()

10304        5
5832         5
5833         5
5834         5
5835         5
         ...
1        65481
6112     79417
0        80431
6111     83554
6110     86227
Name: frequency, Length: 10305, dtype: int64

In [10]:
df_1950.count()

name         10305
gender       10305
frequency    10305
dtype: int64

In [11]:
df_1950.head()

       name gender  frequency
0     Linda      F      80431
1      Mary      F      65481
2  Patricia      F      47944
3   Barbara      F      41554
4     Susan      F      38016

### Adding Function to the For-Loop over the years

In [12]:

df = pd.DataFrame(columns = ['name', 'gender', 'frequency'])

for year in range(1880, 2021):
        df_temp = parse_dataset(year)
        df_temp['year']= year
    
        df = pd.concat([df, df_temp])

In [13]:
df.to_csv('../data/all_years_baby_names.csv', index = False)

In [14]:
 df.sort_values

<bound method DataFrame.sort_values of             name gender frequency    year
0           Mary      F      7065  1880.0
1           Anna      F      2604  1880.0
2           Emma      F      2003  1880.0
3      Elizabeth      F      1939  1880.0
4         Minnie      F      1746  1880.0
...          ...    ...       ...     ...
31512     Zykier      M         5  2020.0
31513      Zylus      M         5  2020.0
31514     Zymari      M         5  2020.0
31515        Zyn      M         5  2020.0
31516      Zyran      M         5  2020.0

[2021558 rows x 4 columns]>

In [15]:
df_sorted = df.sort_values(by='frequency', ascending=False)

In [31]:
df_sorted

          name gender frequency    year
0        Linda      F     99693  1947.0
0        Linda      F     96215  1948.0
6104     James      M     94758  1947.0
7015   Michael      M     92785  1957.0
6105    Robert      M     91650  1947.0
...        ...    ...       ...     ...
8879   Kanisha      F         5  1971.0
8880    Karesa      F         5  1971.0
8881   Karisha      F         5  1971.0
8882     Karli      F         5  1971.0
31516    Zyran      M         5  2020.0

[2021558 rows x 4 columns]

In [29]:
# Find the name with the all-time highest frequency and in which year


Linda in year 1947

0      Mary
0      Mary
0      Mary
0      Mary
0      Mary
      ...
0      Emma
0      Emma
0      Emma
0    Olivia
0    Olivia
Name: name, Length: 141, dtype: object

In [20]:
df['year'] = df['year'].astype('int')

In [21]:
df

            name gender frequency  year
0           Mary      F      7065  1880
1           Anna      F      2604  1880
2           Emma      F      2003  1880
3      Elizabeth      F      1939  1880
4         Minnie      F      1746  1880
...          ...    ...       ...   ...
31512     Zykier      M         5  2020
31513      Zylus      M         5  2020
31514     Zymari      M         5  2020
31515        Zyn      M         5  2020
31516      Zyran      M         5  2020

[2021558 rows x 4 columns]